# Mod10 DataFrame Indexing and Selection

## Data Selection in DataFrame

### DataFrame as a dictionary

In [2]:
import numpy as np
import pandas as pd

In [3]:
np.__version__

'1.19.1'

In [5]:
pd.__version__

'1.0.5'

In [6]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [7]:
data['area'] #dictionary-style indexing  Series

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [8]:
data.area #attribute-style access  不建議己此寫法, 如有相同的屬性會相衝

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

This attribute-style column access actually accesses the exact same object as the dictionary-style access:

In [9]:
data.area is data['area']

True

the ``DataFrame`` has a ``pop()`` method, so ``data.pop`` will point to this rather than the ``"pop"`` column:

In [10]:
data.pop is data['pop']    #因為pd上有一個pop的屬性,此為實例

False

adding a new column:

In [11]:
data['density'] = data['pop'] / data['area']     #向量式運算, 用view的方式, 原稿有變
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

### DataFrame as two-dimensional array

In [12]:
data.columns

Index(['area', 'pop', 'density'], dtype='object')

In [13]:
data.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [14]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

transpose the full ``DataFrame`` to swap rows and columns:

In [15]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

passing a single index to an array accesses a row:

In [16]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

passing a single "index" to a ``DataFrame`` accesses a column:

In [17]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

acess mutiple columns

In [18]:
data[['area','pop']]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [19]:
data['Texas']   #dataframe 預設只能抓列, 不能抓攔, 只能用slice取得列的資料

KeyError: 'Texas'

Using the iloc indexer, the ``DataFrame`` index and column labels are maintained in the result:

In [20]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [27]:
data['area'] # Series

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [28]:
data[['area']]  #DataFrame

              area
California  423967
Texas       695662
New York    141297
Florida     170312
Illinois    149995

In [21]:
data.iloc[1,2]     # index不能算進去

38.01874042279153

In [25]:
#data[0]   #keyError不能用

In [26]:
data[:2]

              area       pop    density
California  423967  38332521  90.413926
Texas       695662  26448193  38.018740

In [31]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [24]:
data.iloc[0]

area       4.239670e+05
pop        3.833252e+07
density    9.041393e+01
Name: California, dtype: float64

In [30]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

Using the ``loc`` indexer we can index the underlying data using the explicit index and column names:

### data.loc['Texax']  
### data.iloc[]  皆為 Series

In [33]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [29]:
data.loc['Texas']

area       6.956620e+05
pop        2.644819e+07
density    3.801874e+01
Name: Texas, dtype: float64

In [40]:
data.loc['Illinois', 'pop']

12882135

In [41]:
data.loc[:'Texas', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193

combine masking and fancy indexing as in the following:

In [42]:
data[data['density'] > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

In [43]:
data.loc[data['density'] > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [46]:
data.loc[data['density'] > 100, 'pop':'density']

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [47]:
data.loc['Texas':'Florida' , ['area','density']]

            area     density
Texas     695662   38.018740
New York  141297  139.076746
Florida   170312  114.806121

In [65]:
# %timeit data.loc['Texas':'Florida' , ['area','density']]

554 µs ± 11 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [62]:
data.iloc[1:4, [0,2]]

            area     density
Texas     695662   38.018740
New York  141297  139.076746
Florida   170312  114.806121

In [71]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [70]:
data.iloc[1:4, 0:3:2]  #slice > fancy > loc

            area     density
Texas     695662   38.018740
New York  141297  139.076746
Florida   170312  114.806121

In [63]:
# %timeit data.iloc[1:4, [0,2]]

306 µs ± 2.68 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

to set or modify values

In [ ]:
data.iloc[0, 2] = 90
data

### Additional indexing conventions

In [72]:
data['Florida':'Illinois'] # slicing rows

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

Such slices can also refer to rows by number rather than by index:

In [73]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

Similarly, direct masking operations are also interpreted row-wise rather than column-wise:

Access a single value for a row/column pair

In [74]:
data.at['Texas','area']

695662

In [75]:
data.loc['Texas','area']

695662

In [76]:
data.iat[4,0]

149995

In [77]:
data.iloc[4,0]

149995

In [81]:
ar = np.arange(10)

In [82]:
ar [ar>5]

array([6, 7, 8, 9])

In [86]:
ar[(ar >5) & (ar < 9)]

array([6, 7, 8])

## Lab

<b>有一個 DataFrame df，取得如下的資料:
* 'two' 整欄的資料
* 'three' 與 'one' 這兩欄的資料
</b>

In [ ]:
np.random.seed(51)
df = pd.DataFrame(np.random.randint(11,70,size=20).reshape((4, 5)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four', 'five'])
df

<b>透過 loc 以及 iloc 取得 'three' 與 'one' 這兩欄的 'Ohio' 與 'Utah' 的資料</b>

<b>透過 at 以及 iat 取得 'Utah' 的 'three' 的資料</b>